#+PROPERTY: header-args+ :var  MEM_STICK="/media/jj/jj"


* MDF osat

** Osien leikkaus MDF levystä

Kotelon osat 3:lle radiolle 600 mm x 800 mm x 19 mm MDF levystä leikattaessa:
- 6 kpl x 232mm x 138mm
- 6 kpl x 232mm x 100mm
- 6 kpl x 100mm x 100mm   

Leikkaussuunnitelma 600 mm x 800 mm levylle:

| 232mm+232mm+100 = 564mm => | 232mm sorko | 232mm sorko | 100mm  sorko |
|---------------------------+-------------+-------------+--------------|
|                           |         138 |         138 |          100 |
|                           |         138 |         100 |          100 |
|                           |         138 |         100 |          100 |
|                           |         138 |         100 |          100 |
|                           |         138 |         100 |          100 |
|                           |         100 |         100 |          100 |
|---------------------------+-------------+-------------+--------------|
| Yhteensä < 800mm          |         790 |         638 |          600 |
#+TBLFM: @>$2=vsum(@I..@II)::@>$3=vsum(@I..@II)::@>$4=vsum(@I..@II)

** Kotelon aukotus
*** Katon aukkojen jyrsintä


[[file:cad/pages/katto.pdf]]


- Origo: xy, keskelle aihiota, z=0 aihion yläpinnalle
- Jyrsintä:
  - 3.2mm poraterällä:
    - katto-01-nappainreijat-pora.ngc
  - 4mm x 20mm terällä:
    - +katto-01-nappainreijat-04mm.ngc+
    - katto-02-liitin-04mm.ngc
  - 6mm x 20mm terällä
    - katto-03-naytto-06mm.ngc

*** Etuseinän aukkojen jyrsintä

[[file:cad/pages/etuseinä.pdf]]

- Origo: xy, keskelle aihiota, z=0 aihion yläpinnalle
- Jyrsintä:
  - 6mm x 20mm terällä
    - etu-kytkin.ngc
    - etu-pls-läpi.ngc
    - etu-pls-upotus.ngc
    - etu-pls-reunat.ngc
  
*** Takaseinän aukkojen jyrsintä


[[file:cad/pages/takaseinä.pdf]]


- Origo: xy, keskelle aihiota, z=0 aihion yläpinnalle
- Jyrsintä:
  - 6mm x 20mm terällä
    - taka-kytkin.ngc
    - taka-keystone-vasen.ngc
    - taka-keystone-oikea.ngc (mikäli kalustetaan RC input:lle)


* Akryyliosat

** Näytön asennuskehys

[[file:cad/laseroinnit/LaserointiNäyttöKehys.pdf]]

** Kaiuttimen asennuskehys

[[file:cad/laseroinnit/LaseroiKaiutinRengas.pdf]]


* 3D tulostus

** Liukukytkimen keystone -sovitin

[[file:cad/3D/keystone-liukukytkin-v10.stl]]

* Maalaus

** Maalaussabluunat

Hakemistossa [[file:cad/sabluunat]] olevat maalaussabluunat

#+BEGIN_SRC bash :eval no-export :results output :exports results
ls cad/sabluunat
#+END_SRC

#+RESULTS:
: JussiSalmiakki.dxf
: JussiSalmiakki.jpg
: JussiSalmiakki.pdf
: JussiSalmiakki.svg


#+CAPTION: JussiSalmiakki
[[file:cad/sabluunat/JussiSalmiakki.pdf]]

* Issues

#+ATTR_LATEX: :font \tiny
   |-----------+-----------+---------------------------------+------------+----------------------------------------+--------------------|
   | #         |      Date | Ref                             | Fixed date | As-is                                  | Tobe               |
   |-----------+-----------+---------------------------------+------------+----------------------------------------+--------------------|
   | JRR-CAD-1 | 15.7.2025 | katto-03-naytto-06mm.ngc        |            | Step down 3+3+0.5+1                    | 3.5 + 3.5 + 0.5    |
   | JRR-CAD-2 | 15.7.2025 | katto-03-liitin-reunat-04mm.ngc |  16.5.2025 | Step down 2.0                          | 3.5                |
   | JRR-CAD-3 | 15.7.2025 | katto-03-liitin-reunat-04mm.ngc |            | Separate from katto-02-liitin-04mm.ngc | Combine            |
   | JRR-CAD-4 | 15.7.2025 | Katto*                          |  16.5.2025 | Safe height < 30mm, Clearance < 10>    | 30/10mm            |
   | JRR-CAD-5 | 15.7.2025 | cad                             |  16.5.2025 | Automate copy to USB                   |                    |
   | JRR-CAD-6 | 15.7.2025 | Katto*                          |  16.5.2025 | Too much to the right                  | -43 mm             |
   | JRR-CAD-7 | 16.7.2025 | Katto                           |  16.5.2025 | Origin lower-right                     | Center block       |
   | JRR-CAD-8 | 20.7.2025 | Katto                           |  20.7.2025 | Drill button holes                     | nappainreijat-pora |
   |-----------+-----------+---------------------------------+------------+----------------------------------------+--------------------|

* Deploy                                                           :noexport:
** Deploy to simutor

#+BEGIN_SRC bash :eval no-export :results output
  echo "Running in $(pwd) host '$(hostname)' on $(date)"
  ROOT_DIR=/home/jj/work/jrr/cad/jyrsi
  FROM_DIRS="$ROOT_DIR/etu $ROOT_DIR/katto $ROOT_DIR/taka"
  TO_DIR=/home/jj/Documents/etool/02-ngc
  for d in $FROM_DIRS; do
      (set -x; cp $d/* $TO_DIR)
  done

  ls -ltr $TO_DIR
  	 
#+END_SRC

#+RESULTS:
#+begin_example
Running in /home/jj/work/jrr host 'eero' on su 20.7.2025 15.50.25 +0300
total 55
-rw-rw-r-- 1 jj jj 9374 heinä  20 15:50 etu-pls-upotus.ngc
-rw-r--r-- 1 jj jj 1514 heinä  20 15:50 etu-pls-reunat.ngc
-rw-r--r-- 1 jj jj 9575 heinä  20 15:50 etu-pls-läpi.ngc
-rw-r--r-- 1 jj jj 1941 heinä  20 15:50 etu-kytkin.ngc
-rw-rw-r-- 1 jj jj 2520 heinä  20 15:50 katto-01-nappainreijat-04mm.ngc
-rw-rw-r-- 1 jj jj 5902 heinä  20 15:50 katto-03-naytto-06mm.ngc
-rw-rw-r-- 1 jj jj 7361 heinä  20 15:50 katto-02-liitin-04mm.ngc
-rw-rw-r-- 1 jj jj  736 heinä  20 15:50 katto-01-nappainreijat-pora.ngc
-rw-rw-r-- 1 jj jj 2559 heinä  20 15:50 taka-kytkin.ngc
-rw-r--r-- 1 jj jj 6195 heinä  20 15:50 taka-keystone-vasen.ngc
-rw-rw-r-- 1 jj jj 7689 heinä  20 15:50 taka-keystone-oikea.ngc
#+end_example


** Deploy to USB stic
#+call: sync-info()

#+RESULTS:
: PROJECT=jrr
: SUB_FOLDER=cad
: MEM_STICK=/media/jj/jj

#+call: sync-doc()

#+RESULTS:
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ke 16.7.2025 08.51.06 +0300
PROJECT=jrr
SUB_FOLDER=cad
MEM_STICK=/media/jj/jj
total 369
drwxr-xr-x 2 jj jj      3 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj      5 heinä   8 14:03 jyrsi
-rw-rw-r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-rw-r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd
total 404
drwxr-xr-x 2 jj jj   4096 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj   4096 heinä   8 14:03 jyrsi
-rw-r--r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-r--r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd
#+end_example

#+call: sync-two-ways()

#+RESULTS:
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ke 16.7.2025 08.51.17 +0300
rsync SUB_FOLDER=cad <----> MEM_STICK/PROJECT=/media/jj/jj/jrr
sending incremental file list

sent 984 bytes  received 48 bytes  2.064,00 bytes/sec
total size is 861.456  speedup is 834,74
sending incremental file list

sent 833 bytes  received 17 bytes  1.700,00 bytes/sec
total size is 861.456  speedup is 1.013,48
/media/jj/jj/jrr:
total 404
drwxr-xr-x 2 jj jj   4096 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj   4096 heinä   8 14:03 jyrsi
-rw-r--r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-r--r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd

cad:
total 369
drwxr-xr-x 2 jj jj      3 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj      5 heinä   8 14:03 jyrsi
-rw-rw-r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-rw-r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd
#+end_example

* Admin                                                            :noexport:
** Sync
:PROPERTIES:
:header-args+: :var  PROJECT="jrr"
:header-args+: :var  SUB_FOLDER="cad"
:END:

*** ~sync-doc~: Show sync info for SUB_FOLDER in PROJECT

#+name: sync-info
#+BEGIN_SRC bash :eval no-export :results output
echo PROJECT=$PROJECT
echo SUB_FOLDER=$SUB_FOLDER
echo MEM_STICK=$MEM_STICK
#+END_SRC

#+RESULTS: show-project
: PROJECT=jrr
: SUB_FOLDER=cad


#+name: sync-doc
#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
echo PROJECT=$PROJECT
echo SUB_FOLDER=$SUB_FOLDER
echo MEM_STICK=$MEM_STICK
ls -ltr $SUB_FOLDER; true
ls -ltr $MEM_STICK/$PROJECT; true
#+END_SRC

*** ~sync-init~: Create directory MEM_STICK/PROJECT 


#+name: sync-init
#+BEGIN_SRC bash :eval no-export :results output
( [ -d $MEM_STICK/$PROJECT ] &&  echo mkdir $MEM_STICK/$PROJECT already exists) || (echo mkdir $MEM_STICK/$PROJECT; mkdir -p $MEM_STICK/$PROJECT )
ls -ltr $MEM_STICK/$PROJECT
#+END_SRC

#+RESULTS: sync-init
: mkdir /media/jj/jj/jrr already exists
: total 0

*** ~sync-two-ways~: Sync SUB_FOLDER to MEM_STICK/PROJECT in two ways

#+call: sync-info()

#+RESULTS:
: PROJECT=jrr
: SUB_FOLDER=cad
: MEM_STICK=/media/jj/jj



#+name: sync-two-ways
#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
echo "rsync SUB_FOLDER=$SUB_FOLDER <----> MEM_STICK/PROJECT=$MEM_STICK/$PROJECT"
find $SUB_FOLDER -name '*~' -delete
find $SUB_FOLDER -name '#*' -delete
find $MEM_STICK/$PROJECT -name '*~' -delete
find $MEM_STICK/$PROJECT -name '#*' -delete
# rm -f *~ $SUB_FOLDER/*~ $MEM_STICK/$PROJECT/*~
# rm -f  $SUB_FOLDER/#* $MEM_STICK/$PROJECT/#*
# rm -f  $SUB_FOLDER/.#* $MEM_STICK/$PROJECT/.#*
# rm -f  $SUB_FOLDER/.~*# $MEM_STICK/$PROJECT/.~*
rsync -a --update --verbose  --checksum --recursive  $SUB_FOLDER/ $MEM_STICK/$PROJECT/
rsync -a --update --verbose  --checksum --recursive  $MEM_STICK/$PROJECT/ $SUB_FOLDER/
ls -ltr $MEM_STICK/$PROJECT  $SUB_FOLDER
#+END_SRC

#+RESULTS: sync-two-ways
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ke 16.7.2025 08.50.02 +0300
rsync SUB_FOLDER=cad <----> MEM_STICK/PROJECT=/media/jj/jj/jrr
sending incremental file list

sent 984 bytes  received 48 bytes  2.064,00 bytes/sec
total size is 861.456  speedup is 834,74
sending incremental file list

sent 833 bytes  received 17 bytes  1.700,00 bytes/sec
total size is 861.456  speedup is 1.013,48
/media/jj/jj/jrr:
total 404
drwxr-xr-x 2 jj jj   4096 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj   4096 heinä   8 14:03 jyrsi
-rw-r--r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-r--r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd

cad:
total 369
drwxr-xr-x 2 jj jj      3 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj      5 heinä   8 14:03 jyrsi
-rw-rw-r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-rw-r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd
#+end_example



* Fin                                                              :noexport:


** Emacs variables

#+RESULTS:

# Local Variables:
# time-stamp-line-limit: -8
# time-stamp-start: "Modified:"
# time-stamp-format: "%:y-%02m-%02d.%02H:%02M"
# time-stamp-time-zone: nil
# time-stamp-end: "; # time-stamp"
# eval: (add-hook 'before-save-hook 'time-stamp)
# org-confirm-babel-evaluate: nil
# End:
#
# Muuta
# org-cdlatex-mode: t
# eval: (cdlatex-mode)
#
# Local ebib:
# org-ref-default-bibliography: "./jrr-cad.bib"
# org-ref-bibliography-notes: "./jrr-cad-notes.org"
# org-ref-pdf-directory: "./pdf/"
# org-ref-notes-directory: "."
# bibtex-completion-notes-path: "./jrr-cad-notes.org"
# ebib-preload-bib-files: ("./jrr-cad.bib")
# ebib-notes-file: ("./jrr-cad-notes.org")
# reftex-default-bibliography: ("./jrr-cad.bib")


Modified:2025-07-20.15:54; # time-stamp
